app/views/users/show.html.erb

SELECT COUNT(*) FROM "authors" WHERE "authors"."user_id" = 1
---
  <div class="span8">
    <% if @user.authors.any? %>