app/views/shared/_user_info.html.erb

<span>
  <%= pluralize(current_user.authors.count, "author") %>
---
SELECT COUNT(*) FROM "authors" WHERE "authors"."user_id" = 1