app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "nom", "prenom", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 04 Jan 2013 11:13:51 UTC +00:00], ["nom", "RASAMIZANANY"], ["prenom", "Kune"], ["updated_at", Fri, 04 Jan 2013 11:13:51 UTC +00:00], ["user_id", 1]]
---
  def create
	@author = current_user.authors.build(params[:author])
    if @author.save