app/controllers/publications_controller.rb

  def index
      @publications = Publication.all
---
SELECT "publications".* FROM "publications"

  def create
    @publication = Publication.new(params[:publication])
    if @publication.save
---
INSERT INTO "publications" ("annee", "created_at", "mois", "nom", "notes", "pages", "resume", "titre", "typePublication", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)