app/controllers/static_pages_controller.rb

SELECT "authors".* FROM "authors" WHERE (user_id = 61) ORDER BY authors.nom ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "authors" WHERE "authors"."user_id" = 1
---
  def home
    if signed_in?
     @author = current_user.authors.build if signed_in?
     @feed_items = current_user.feed.paginate(page: params[:page])