app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "authors".* FROM "authors" WHERE "authors"."user_id" = 31 ORDER BY authors.nom ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "authors" WHERE "authors"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @authors = @user.authors.paginate(page: params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$2BmZjgJ8KrKY7olfmAilMunTwxgkfMSI104meQmwqVwF3qh3Ix4qS', "remember_token" = 'Vzx1FAaNezMKUvHZUGZPKg', "updated_at" = '2012-12-26 10:57:49.451176' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])